app/controllers/articles_controller.rb

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
---
	def destroy
		@article = Article.find(params[:id]).destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "smile.png"], ["image_file_size", 131743], ["image_updated_at", "2016-01-21 12:15:04.297199"], ["updated_at", "2016-01-21 12:15:07.891374"], ["id", 17]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)