app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
	def create
	@comment = Comment.new(comment_params)
	@comment.article_id = params[:article_id]
	@comment.save