app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@tag = Tag.find(params[:id])

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 3]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 3]]
---
	def destroy
		@tag = Tag.find(params[:id]).destroy